Repository: AKotov-dev/SnappyCleaner
Catalog: SnappyCleaner/languages/SnappyCleaner.*.po
Languages: ru

source: About
ru: О программе

source: MgaRemix Cleaning Program License: GPLv3 Compilation: Lazarus 4.4 Author: alex_q_2000 (C) 2026 Co - authorship: ingvaro Gratitude: algri14, AlexL, mozg1986, Zomby, TopE, kvv-vp https://github.com/AKotov-dev/SnappyCleaner
ru: Программа очистки MgaRemix Лицензия: GPLv3 Компиляция: Lazarus 4.4 Автор: alex_q_2000 (C) 2026 Соавторство: ingvaro Благодарность: algri14, AlexL, mozg1986, Zomby, TopE, kvv-vp https://github.com/AKotov-dev/SnappyCleaner

source: Cancel
ru: Отмена

source: Required for this package:
ru: Требуются для этого пакета:

source: This package is required for:
ru: Этот пакет требуется для:

source: Search
ru: Поиск

source: Analyze
ru: Анализ

# tmainform.cachebravecheck.caption
source: Brave browser cache:
ru: Кеш браузера Brave:

source: Google Chrome cache:
ru: Кеш Google Chrome:

source: Chromium cache:
ru: Кеш Chromium:

source: DNF Cache:
ru: Кеш DNF:

source: Mozilla Firefox cache:
ru: Кеш Mozilla Firefox:

source: Opera cache:
ru: Кеш Opera:

source: PaleMoon cache:
ru: Кеш PaleMoon:

source: URPMI Cache:
ru: Кеш URPMI:

source: Clean
ru: Очистка

source: Orphaned packages list:
ru: Список осиротевших пакетов:

source: Using /home:
ru: Использование /home:

source: List of kernels to delete:
ru: Список ядер к удалению:

source: User:
ru: Пользователь:

source: Active kernel:
ru: Активное ядро:

source: Save the list to a file
ru: Сохранить список в файл

source: Copy the position to the buffer
ru: Копировать позицию в буфер

source: Mark as not orphaned
ru: Отметить как не осиротевший

# tmainform.oldkerneldepsbtn.hint
source: Show dependencies
ru: Показать зависимости

# tmainform.oldresetselection.hint
source: Reset selection
ru: Сброс выбора

# tmainform.oldselectallbtn.hint
source: Select all
ru: Выбрать все

# tmainform.orphansdepsbtn.hint
source: Show dependencies
ru: Показать зависимости

# tmainform.orphansresetselection.hint
source: Reset selection
ru: Сброс выбора

# tmainform.orphansselectallbtn.hint
source: Select all
ru: Выбрать все

source: Wipe options
ru: Опции очистки

source: Repair RPM DataBase
ru: Ремонтировать RPM-DB

source: Directory /root/tmp:
ru: Каталог /root/tmp:

source: Select/Reset all
ru: Выбрать/Сбросить все

source: start analysis of system...
ru: запустите анализ системы...

source: Recent Documents:
ru: Последние документы:

source: User Temporary files:
ru: Временные файлы:

source: User Trash files:
ru: Корзина юзера:

source: The application is alredy running!
ru: Приложение уже запущено!

# unit1.sanalisescompleted
source: analysis completed...
ru: анализ завершен...

source: run analysis of the package dependencies, wait...
ru: запущен анализ зависимостей пакета, ждите...

source: clean Brave browser cache, wait...
ru: очистка кеша браузера Brave, ждите...

source: clean Google Chrome cache, wait...
ru: очистка кеша Google Chrome, ждите...

source: clean Chromium browser cache, wait...
ru: очистка кеша браузера Chromium, ждите...

source: clean DNF cache, wait...
ru: очистка кеша DNF, ждите...

source: clean Mozilla Firefox cache, wait...
ru: очистка кеша Mozilla Firefox, ждите...

source: clean Opera browser cache, wait...
ru: очистка кеша браузера Opera, ждите...

source: clean PaleMoon browser cache, wait...
ru: очистка кеша браузера PaleMoon, ждите...

source: clean RecentDocuments user files, wait...
ru: очистка файлов RecentDocuments, ждите...

# unit1.scleanthumbnails
source: clean ~/.cache/thumbnails/*, wait...
ru: очистка ~/.cache/thumbnails/*, ждите...

source: clean the temporary root files, wait...
ru: очистка временных файлов root, ждите...

source: clean temporary user files, wait...
ru: очистка временных файлов пользователя, ждите...

source: clean URPMI cache, wait...
ru: очистка кеша URPMI, ждите...

source: clean the user recycle bin, wait...
ru: очистка корзины пользователя, ждите...

source: Confirm running the cleanup?
ru: Подтверждаете запуск очистки?

source: dependency analysis package is completed...
ru: анализ зависимостей пакета завершен...

source: empty
ru: пусто

source: The kernels selected for removal:
ru: Ядра, выбранные для удаления:

source: launched by the marking process, wait...
ru: запущен процесс маркировки, ждите...

source: Exclude the selected packages from the list of orphans?
ru: Исключить выбранные пакеты из списка сирот?

source: mark packages placed
ru: метки пакетов расставлены

source: no
ru: нет

source: Nothing is selected to clean!
ru: Ничего не выбрано для очистки!

source: Package:
ru: Пакет:

source: process is terminated, wait...
ru: процесс завершается, ждите...

source: remove the selected packages, wait...
ru: удаление выбранных пакетов, ждите...

source: repairing the RPM database, wait...
ru: ремонт базы данных RPM, ждите...

source: Search the packages dependencies
ru: Поиск зависимостей пакетов

source: run analysis of the system, wait...
ru: запущен анализ системы, ждите...
